1. Download the customer data set and add it to your “Original Data” folder.
2. Create a new notebook in your “Scripts” folder for part 1 of this task.
3. Import your analysis libraries, as well as your new customer data set as a dataframe.

In [1]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import scipy
import seaborn as sn

In [2]:
my_path = r'C:\Users\nkasb\Documents\Instacart Basket Analysis'

In [3]:
df = pd.read_csv(os.path.join(my_path, '2. Data', 'Original Data', 'customers.csv'))

In [4]:
df.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [5]:
df.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

4. Data wrangling : Dropping columns, renaming columns, changing data type, transposing data

Dropping columns

In [6]:
df['date_joined'].value_counts()

9/17/2018     213
2/10/2018     212
4/1/2019      211
9/21/2019     211
12/19/2017    210
             ...
9/1/2018      141
1/22/2018     140
11/24/2017    139
7/18/2019     138
8/6/2018      128
Name: date_joined, Length: 1187, dtype: int64

In [7]:
df['n_dependants'].value_counts()

0    51602
3    51594
1    51531
2    51482
Name: n_dependants, dtype: int64

all columns are useful and contain different values so here we will not drop any columns

renaming columns: user_id -> User_id, First Name -> First_name, Surnam -> Last_name, STATE -> State, income -> Income, 
date_joined -> Date_joined, fam_status -> Fam_status

In [8]:
df.rename(columns = {'user_id' : 'User_id', 'First Name' : 'First_name', 'Surnam' : 'Last_name', 'STATE' : 'State',
          'income' : 'Income', 'date_joined' : 'Date_joined', 'fam_status' : 'Fam_status'}, inplace = True)

In [9]:
df.head()

,User_id,First_name,Last_name,Gender,State,Age,Date_joined,n_dependants,Fam_status,Income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

Changing data type: User_id (Int -> Str)

In [10]:
df['User_id'] = df['User_id'].astype('str')

In [11]:
df['User_id'].head()

0     26711
1     33890
2     65803
3    125935
4    130797
Name: User_id, dtype: object

Transposing: here the data is perfectly readable in is long format. Therefore no need to transpose the columns

5. Complete the fundamental data quality and consistency checks you’ve learned throughout this Achievement; for example, check for and address missing values and duplicates, and convert any mixed-type data.

- Adressing mix-type data
- Adressing missing values
- Adressing duplicates

Adressing mix-type data

In [12]:
df.describe()

                 Age   n_dependants         Income
count  206209.000000  206209.000000  206209.000000
mean       49.501646       1.499823   94632.852548
std        18.480962       1.118433   42473.786988
min        18.000000       0.000000   25903.000000
25%        33.000000       0.000000   59874.000000
50%        49.000000       1.000000   93547.000000
75%        66.000000       3.000000  124244.000000
max        81.000000       3.000000  593901.000000

In [13]:
for col in df.columns.tolist():
  weird = (df[[col]].applymap(type) != df[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df[weird]) > 0:
    print (col)

First_name

First_name has mix-type data

In [14]:
df['First_name'] = df['First_name'].astype('str')

Adressing missing values

In [15]:
df.isnull().sum()

User_id         0
First_name      0
Last_name       0
Gender          0
State           0
Age             0
Date_joined     0
n_dependants    0
Fam_status      0
Income          0
dtype: int64

we identified no missing values

Adressing duplicates

In [16]:
df_dups = df[df.duplicated()]

In [17]:
df_dups.head()

Empty DataFrame
Columns: [User_id, First_name, Last_name, Gender, State, Age, Date_joined, n_dependants, Fam_status, Income]
Index: []

we identified no duplicates

6. Combine your customer data with the rest of your prepared Instacart data.

In [18]:
df_1 = pd.read_pickle(os.path.join(my_path, '2. Data', 'Prepared Data', 'orders_products_merged_task8.pkl'))

In [19]:
df_1.head()

,Unnamed: 0_x,product_id,product_name,aisle_id,department_id,prices,Unnamed: 0_y,order_id,user_id,eval_set,...,reordered,_merge,busiest day,busiest days,busiest_period_of_days,max_order,loyalty_flag,Spending_flag,median_orders,frequency_flag
0,0.0,1.0,Chocolate Sandwich Cookies,61.0,19.0,5.8,1987.0,3139998.0,138.0,prior,...,0.0,both,Regularly busy,Regularly busy days,Most orders,33.0,Regular customer,NaN,30.0,non-frequent customer
1,0.0,1.0,Chocolate Sandwich Cookies,61.0,19.0,5.8,1989.0,1977647.0,138.0,prior,...,1.0,both,Regularly busy,Regularly busy days,Average orders,33.0,Regular customer,NaN,30.0,non-frequent customer
2,0.0,1.0,Chocolate Sandwich Cookies,61.0,19.0,5.8,11433.0,389851.0,709.0,prior,...,0.0,both,Busiest day,Busiest days,Average orders,6.0,New customer,Low spender,8.0,frequent customer
3,0.0,1.0,Chocolate Sandwich Cookies,61.0,19.0,5.8,12198.0,652770.0,764.0,prior,...,0.0,both,Regularly busy,Regularly busy days,Most orders,4.0,New customer,Low spender,13.0,Regular customer
4,0.0,1.0,Chocolate Sandwich Cookies,61.0,19.0,5.8,12200.0,1813452.0,764.0,prior,...,1.0,both,Least busy,Least busy days,Average orders,4.0,New customer,Low spender,13.0,Regular customer

In [20]:
df_1['user_id'].head()

0    138.0
1    138.0
2    709.0
3    764.0
4    764.0
Name: user_id, dtype: float64

In [21]:
df['User_id'] = df['User_id'].astype('float')

In [22]:
df.dtypes

User_id         float64
First_name       object
Last_name        object
Gender           object
State            object
Age               int64
Date_joined      object
n_dependants      int64
Fam_status       object
Income            int64
dtype: object

In [23]:
df.rename(columns = {'User_id' : 'user_id'}, inplace = True)

In [24]:
df_1.dtypes

Unnamed: 0_x               float64
product_id                 float64
product_name                object
aisle_id                   float64
department_id              float64
prices                     float64
Unnamed: 0_y               float64
order_id                   float64
user_id                    float64
eval_set                    object
order_number               float64
order_dow                  float64
order_hour_of_day          float64
days_since_prior_order     float64
add_to_cart_order          float64
reordered                  float64
_merge                    category
busiest day                 object
busiest days                object
busiest_period_of_days      object
max_order                  float64
loyalty_flag                object
Spending_flag               object
median_orders              float64
frequency_flag              object
dtype: object

In [25]:
df_2 = df.merge(df_1, on = 'user_id', indicator = 'true')

In [28]:
df_2.to_pickle(os.path.join(my_path, '2. Data','Prepared Data', 'orders_products_costumers.pkl'))